import Mock from 'mockjs'
// 获取 mock.Random 对象
const Random = Mock.Random;
//使用mockjs模拟数据
//import mapjson from './data/map.json'

const mapjson = {"status":"success","list":[
	{"name":"广州","value":70,"score":[80,50,40,60,50]},
	{"name":"韶关","value":50,"score":[90,50,40,80,60]},
	{"name":"深圳","value":80,"score":[85,50,60,60,80]},
	{"name":"珠海","value":90,"score":[60,50,50,60,60]},
	{"name":"汕头","value":80,"score":[70,50,70,60,70]},
	{"name":"佛山","value":95,"score":[60,50,50,60,60]},
	{"name":"江门","value":90,"score":[70,50,70,60,70]},
	{"name":"湛江","value":65,"score":[60,50,50,60,60]},
	{"name":"茂名","value":75,"score":[70,50,70,60,70]},
	{"name":"肇庆","value":80,"score":[60,50,50,60,60]},
	{"name":"惠州","value":70,"score":[70,50,70,60,70]},
	{"name":"梅州","value":70,"score":[70,50,70,60,70]},
	{"name":"汕尾","value":90,"score":[70,50,70,60,70]},
	{"name":"河源","value":70,"score":[70,50,70,60,70]},
	{"name":"阳江","value":80,"score":[80,50,70,60,70]},
	{"name":"清远","value":70,"score":[70,50,70,60,70]},
	{"name":"东莞","value":65,"score":[70,50,70,60,70]},
	{"name":"中山","value":60,"score":[90,50,70,60,70]},
	{"name":"潮州","value":70,"score":[70,50,70,60,70]},
	{"name":"揭阳","value":60,"score":[90,50,70,60,70]},
	{"name":"云浮","value":70,"score":[70,50,70,60,70]}
]};
const flowChart1 = {"status":"success","list":[
	["product", "流入人数"],
	["2015",39.59],
	["2016",42.47],
	["2017",43.72],
	["2018",45.62],
	["2019",45.79]
]};
const flowChart2 = {"status":"success","list":[
	["product","流入人数","流入率"],
	["广州",42.47,9.2],
	["韶关",48.83,8.7],
	["深圳",46.9,7.5],
	["珠海",39.59,7.6],
	["汕头",47.9,7.2],
	["佛山",45.79,7.1],
	["江门",45.62,6.7],
	["湛江",43.72,6],
	["茂名",47.2,6],
	["肇庆",47.47,4.6],
	["惠州",48.42,3.5],
	["梅州",48.42,3.5],
	["汕尾",48.42,3.5],
	["河源",48.42,3.5],
	["阳江",48.42,3.5],
	["清远",48.42,3.5],
	["东莞",48.42,3.5],
	["中山",48.42,3.5],
	["潮州",48.42,3.5],
	["揭阳",48.42,3.5],
	["云浮",48.42,3.5]
]};
const salaryChart1 = {"status":"success","list": [
	["product", "20万以上","10~15万","6~10万","3~6万","3万以下"],
	["3万以下",4],
	["3~6万",40],
	["6~10万",50],
	["10~15万",20],
	["20万以上",6]
]};
const salaryChart2 = {"status":"success","list":[
	["product", "20万以上","10~15万","6~10万","3~6万","3万以下"],
	["广州",0.53,24.87,43.72,19.03,6.02,5.84],
	["韶关",0.86,23.58,46.9,15.4,7.52,5.74],
	["深圳",0.63,30.78,47.47,13.58,4.66,2.88],
	["珠海",1.18,30.66,48.42,13.29,3.95,2.5],
	["汕头",1.44,23.21,48.83,14.08,8.27,4.17],
	["佛山",1.28,24.89,47.9,14.68,7.12,4.13],
	["江门",1.09,35.84,39.59,11.74,7.26,4.48],
	["湛江",1.62,25.75,45.62,14.98,6.75,5.28],
	["茂名",1.07,25.2,47.2,16.13,6,4.4],
	["肇庆",1.41,27.99,42.47,13.31,9.02,5.8],
	["惠州",1.31,25.23,45.79,17.01,7.1,3.55],
	["梅州",1.07,25.2,47.2,16.13,6,4.4],
	["汕尾",1.41,27.99,42.47,13.31,9.02,5.8],
	["河源",1.07,25.2,47.2,16.13,6,4.4],
	["东莞",1.07,25.2,47.2,16.13,6,4.4],
	["阳江",1.41,27.99,42.47,13.31,9.02,5.8],
	["清远",1.07,25.2,47.2,16.13,6,4.4],
	["中山",1.07,25.2,47.2,16.13,6,4.4],
	["潮州",1.41,27.99,42.47,13.31,9.02,5.8],
	["揭阳",1.31,25.23,45.79,17.01,7.1,3.55],
	["云浮",1.31,25.23,45.79,17.01,7.1,3.55]
]};
const trendChart = {"status":"success","list":[
	["product", "生产总值","人才数量"],
	["2015",39.59,11.74],
	["2016",42.47,17.29],
	["2017",43.72,16.31],
	["2018",45.62,15.58],
	["2019",45.79,20.08]
]};
const talentsChart = {"status":"success","list":[
	["product", "人才数量","占比"],
	["广州",27.99,9],
	["韶关",23.21,8.2],
	["深圳",23.58,7.2],
	["珠海",35.84,7.2],
	["汕头",24.89,7.1],
	["佛山",25.23,7.1],
	["江门",25.75,6.5],
	["湛江",24.87,6.2],
	["茂名",25.2,6],
	["肇庆",30.78,4.6],
	["梅州",30.66,3.9],
	["汕尾",24.89,7.1],
	["河源",25.23,7.1],
	["阳江",25.75,6.5],
	["清远",24.87,6.2],
	["中山",25.2,6],
	["潮州",25.2,6],
	["揭阳",30.78,4.6],
	["云浮",30.66,3.9]
]};
const businessChart = {"status":"success","list":[
	["product", "企业数量","占比"],
	["广州",42.47,9.2],
	["韶关",48.83,8.7],
	["深圳",46.9,7.5],
	["珠海",39.59,7.6],
	["汕头",47.9,7.2],
	["佛山",45.79,7.1],
	["江门",45.62,6.7],
	["湛江",43.72,6],
	["茂名",47.2,6],
	["肇庆",47.47,4.6],
	["惠州",48.42,3.5],
	["梅州",48.42,3.5],
	["汕尾",48.42,3.5],
	["河源",48.42,3.5],
	["阳江",48.42,3.5],
	["清远",48.42,3.5],
	["东莞",48.42,3.5],
	["中山",48.42,3.5],
	["潮州",48.42,3.5],
	["揭阳",48.42,3.5],
	["云浮",48.42,3.5]
]}
const salaryRankingChart = {"status":"success","list": [
	["product", "人才增长率","gdp增长率","相关性指数"],
	["广州",23,21,11],
	["韶关",23,58,13],
	["深圳",24,87,13],
	["珠海",24,89,13],
	["佛山",25,2,14],
	["江门",25,23,14],
	["湛江",25,75,14],
	["茂名",27,99,15],
	["肇庆",30,66,16],
	["惠州",30,78,17],
	["梅州",35,84,19],
	["汕尾",30,66,16],
	["河源",24,87,13],
	["阳江",24,89,13],
	["清远",25,2,14],
	["东莞",25,23,14],
	["中山",25,75,14],
	["潮州",26,99,15],
	["揭阳",27,99,15],
	["云浮",27.8,99,15]
]}
const policyChart = {"status":"success","list":[
	["product", "数量"],
	["广州",92],
	["韶关",87],
	["深圳",75],
	["珠海",76],
	["汕头",72],
	["佛山",71],
	["江门",67],
	["湛江",6],
	["茂名",6],
	["肇庆",46],
	["惠州",35],
	["梅州",45],
	["汕尾",48],
	["河源",48],
	["阳江",48],
	["清远",43],
	["东莞",42],
	["中山",44],
	["潮州",45],
	["揭阳",45],
	["云浮",44]

]};
const schoolInstituteChart = {"status":"success","list":[
	["product","高校","研究所"],
	["广州",21,11],
	["韶关",58,13],
	["深圳",87,13],
	["珠海",24,89,13],
	["佛山",25,14],
	["江门",23,14],
	["湛江",75,14],
	["茂名",99,15],
	["肇庆",66,16],
	["惠州",78,17],
	["梅州",84,19],
	["汕尾",66,16],
	["河源",87,13],
	["阳江",89,13],
	["清远",22,14],
	["东莞",23,14],
	["中山",75,14],
	["潮州",99,15],
	["揭阳",99,15],
	["云浮",99,15]
]};
const demandChart = {"status":"success","list": [
	["product", "需求量"],
	["01-01",162],
	["01-08",198],
	["01-15",120],
	["01-22",129],
	["01-29",104],
	["02-05",79],
	["02-12",15],
	["02-19",76],
	["02-26",125],
	["03-05",63],
	["03-12",23],
	["03-19",218],
	["03-26",203],
	["04-02",210],
	["04-09",215],
	["04-16",204],
	["04-23",241],
	["04-30",222],
	["05-07",247],
	["05-14",232],
	["05-21",228],
	["05-28",230],
	["06-04",223],
	["06-11",235],
	["06-18",206],
	["06-25",208]
]}
const patentChart ={"status":"success","list":[
	["2015",20,32,12,100,50],
	["2016",32,62,62,120,40],
	["2017",42,52,82,100,60],
	["2018",62,72,22,110,70],
	["2019",72,32,12,120,90] 
]};
const ageChart = {"status":"success","list":[[
	["product","男","女"],
	["70岁以上",72,28],
	["60-65岁",62,38],
	["40-45岁",20,80],
	["30-35岁",32,68],
	["30岁以下",40,60]
],[
	["0-30岁",32,68],
	["30-50岁",72,28],
	["50岁以上",42,58]
],[
	["0-30岁",100],
	["30-50岁",100],
	["50岁以上",100]
]]};
const highEndChart =  {"status":"success","list":[
	["广东大学",3099,90],
	["广东外语外贸大学",2421,82],
	["广东金融学院",2358,72],
	["华南师范大学",3684,72],
	["华南农业大学",2489,71],
	["广东理工大学",2523,71],
	["南方科技大学",2575,65],
	["汕头大学",2487,62],
	["广东科技学院",2520,56],
	["佛山科技学院",3078,46]
]};
const schoolChart = {"status":"success","list":[
	["广东大学",3584,72],
	["广东外语外贸大学",2799,90],
	["广东金融学院",2321,82],
	["华南师范大学",2358,72],
	["华南农业大学",2489,71],
	["广东理工大学",2523,71],
	["南方科技大学",2575,65],
	["汕头大学",2487,62],
	["广东科技学院",2052,60],
	["佛山科技学院",3078,46]
]};
const flowChart = {"status":"success","list":[
	["2015",3959,1174],
	["2016",4247,1729],
	["2017",4372,1631],
	["2018",4562,1558],
	["2019",4579,2008]
]};
const contributeChart = {"status":"success","list":[
	{"name":"得分","value":80},
	{"name":"排名","value":20}
]};
const gradationChart = {"status":"success","list":[
	{"name":"得分","value":90},
	{"name":"排名","value":14}
]};
const efficiencyChart = {"status":"success","list":[
	{"name":"得分","value":70},
	{"name":"排名","value":30}
]};
const arrangementChart = {"status":"success","list":[
	{"name":"得分","value":75},
	{"name":"排名","value":16}
]};
const mapJson ={"status":"success","list":[
{"name":"江苏","value":50},
{"name":"浙江","value":80},
{"name":"海南","value":90},
{"name":"山东","value":80},
{"name":"河南","value":95},
{"name":"河北","value":90},
{"name":"湖南","value":65},
{"name":"湖北","value":75},
{"name":"天津","value":80},
{"name":"重庆","value":70}
]};
const table = {"status":"success","list":[
	{"name":"制造业","talent":[2,2],"invest":[2,-2],"forecast":[2,2]},
	{"name":"造船","talent":[2,2],"invest":[2,2],"forecast":[3,-2]},
	{"name":"纺织业","talent":[2,-2],"invest":[2,-2],"forecast":[3,-2]},
	{"name":"园林业","talent":[2,2],"invest":[2,2],"forecast":[10,2]},
	{"name":"教育行业","talent":[2,-2],"invest":[2,-2],"forecast":[3,-2]},
	{"name":"销售业","talent":[2,-2],"invest":[2,2],"forecast":[3,2]},
	{"name":"园林业","talent":[2,2],"invest":[2,-2],"forecast":[3,-2]},
	{"name":"园林业","talent":[2,-2],"invest":[2,2],"forecast":[3,2]}
]};
Mock.mock('#/api/map', 'get', mapjson);
Mock.mock('#/api/flowChart1', 'get', flowChart1);
Mock.mock('#/api/flowChart2', 'get', flowChart2);
Mock.mock('#/api/salaryChart1', 'get', salaryChart1);
Mock.mock('#/api/salaryChart2', 'get', salaryChart2);
Mock.mock('#/api/trendChart', 'get', trendChart);
Mock.mock('#/api/talentsChart', 'get', talentsChart);
Mock.mock('#/api/businessChart', 'get', businessChart);
Mock.mock('#/api/salaryRankingChart', 'get', salaryRankingChart);
Mock.mock('#/api/policyChart', 'get', policyChart);
Mock.mock('#/api/schoolInstituteChart', 'get', schoolInstituteChart);
Mock.mock('#/api/demandChart', 'get', demandChart);

//人才 模拟接口
Mock.mock('#/api/patentChart', 'get', patentChart);
Mock.mock('#/api/ageChart', 'get', ageChart);
Mock.mock('#/api/highEndChart', 'get', highEndChart);
Mock.mock('#/api/schoolChart', 'get', schoolChart);
Mock.mock('#/api/flowChart', 'get', flowChart);
Mock.mock('#/api/contributeChart', 'get', contributeChart);
Mock.mock('#/api/gradationChart', 'get', gradationChart);
Mock.mock('#/api/efficiencyChart', 'get', efficiencyChart);
Mock.mock('#/api/arrangementChart', 'get', arrangementChart);
Mock.mock('#/api/mapJson', 'get', mapJson);
Mock.mock('#/api/table', 'get', table);